{
  "<pad>": 46943,
  "<unk>": 46944,
  "<user>": 46945,
  "<assistant>": 46946,
  "<reasoning>": 46947,
  "</reasoning>": 46948,
  "<system>": 46949,
  "<answer>": 46950,
  "</answer>": 46951,
  "<image>": 46952,
  "<unuse_token_1>": 46953,
  "<unuse_token_2>": 46954
}
